0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inletOverset
    {
          type              groovyBC;
          variables         "r=1.25/2;x1=(-0.65+r);x2=(-0.65-r);z=(0);y=(2.52531);pOne=1.e-3*vector(x1,y,z);pTwo=1.e-3*vector(x2,y,z);pMid=0.5*(pOne+pTwo);ww=1.0-mag(pos()-pMid)/mag(pOne-pTwo)/0.5;";
          valueExpression   "vector(-0.35,-1.97,0)*pow(ww > 0.0 ? ww : 0, 1./4.)";
          value             uniform (0 0 0);
    }   
    "outlet_ext*"
    {
        type            zeroGradient;
        value           uniform (0 0 0);
    }

    "outlet_wall*|outlet_empty*"
    {
        type            slip;
    }
	  "workpiece|workpieceOverset"
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
	
    "front|frontOverset"
    {
       type            fixedValue;
       value           uniform (0 0 0);
    }
	
    "tool|toolOverset"
    {
       type            fixedValue;
       value           uniform (0 0 0);
        
    }
    
    "wall|wallOverset"
    {
      type            fixedValue;
      value           uniform (0 0 0);
    }

   "outlet|outletOverset"
   {
       type            fixedValue;
       value           uniform (0 0 0);
   }

   "back|backOverset"
   {
       type            empty;
       
   }
   "Overset|outletOverset_side_1|outletOverset_side_2|outletOverset_side_3|outletOverset_side_4|outletOverset_side_5|outletOverset_side_6|outletOverset_side_7|outletOverset_side_8"
   {
       type            overset;
   }
   inlet
   {
      type            fixedValue;
      value           uniform (0 0 0);
    }
}


// ************************************************************************* //
