0/zoneID
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      zoneID;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
497714
(
0
0
0
0
0
0
0
0
...
)
;

boundaryField
{
    back
    {
        type            empty;
    }
    wall
    {
        type            zeroGradient;
    }
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    workpiece
    {
        type            zeroGradient;
    }
    tool
    {
        type            zeroGradient;
    }
    front
    {
        type            zeroGradient;
    }
    outlet_empty
    {
        type            zeroGradient;
    }
    outlet_wall
    {
        type            zeroGradient;
    }
    outlet_ext
    {
        type            zeroGradient;
    }
    backOverset
    {
        type            empty;
    }
    Overset
    {
        type            overset;
        value           uniform 1;
    }
    workpieceOverset
    {
        type            zeroGradient;
    }
    toolOverset
    {
        type            zeroGradient;
    }
    wallOverset
    {
        type            zeroGradient;
    }
    inletOverset
    {
        type            zeroGradient;
    }
    outletOverset
    {
        type            zeroGradient;
    }
    frontOverset
    {
        type            zeroGradient;
    }
    outletOverset_side_1
    {
        type            overset;
        value           uniform 1;
    }
    outletOverset_side_2
    {
        type            overset;
        value           uniform 1;
    }
    outletOverset_side_3
    {
        type            overset;
        value           uniform 1;
    }
    outletOverset_side_4
    {
        type            overset;
        value           uniform 1;
    }
    outletOverset_side_5
    {
        type            overset;
        value           uniform 1;
    }
    outletOverset_side_6
    {
        type            overset;
        value           uniform 1;
    }
    outletOverset_side_7
    {
        type            overset;
        value           uniform 1;
    }
    outletOverset_side_8
    {
        type            overset;
        value           uniform 1;
    }
}


// ************************************************************************* //
